[
  {
    "version": "0.5.4",
    "date": "2025-04-15",
    "changes": [
      "Добавлен режим аккаунта «Тестовый»:",
      "Теперь в магазине и на локациях будут появляться тестовые предметы и враги, но только при наличии специального статуса аккаунта;",
      "Подробнее о возможности активировать тестовые опции можно узнать в разделе «Вопросы и предложения» на главной странице.",
      "Переработана логика поиска врагов на локации, а также улучшен дизайн их карточек:",
      "Теперь враги на локации определяются случайным образом в количестве от 3 до 6 включительно;",
      "При этом уровень врагов не будет превышать уровень игрока более чем на 1. Также гарантированно будет появляться не менее 2 случайных врагов с уровнем, равным уровню игрока.",
      "Исправлены некоторые неточности и улучшена оптимизация."
    ]
  },
  {
    "version": "0.5.3",
    "date": "2025-04-14",
    "changes": [
      "Добавлена система кейсов.",
      "Теперь с врагов с шансом 5% может выпасть «Магический ключ». Он необходим для открытия специальных сундуков, которые можно приобрести в магазине в разделе «Расходные».",
      "Новые предметы:",
      "— Магический ключ;",
      "— Запечатанный магией серебряный сундук;",
      "— Запечатанный магией золотой сундук богатства;",
      "— Запечатанный магией платиновый сундук невообразимого богатства;",
      "Добавлена механика открытия кейсов.",
      "Страница «Помощь» переименована в «База знаний».",
      "Добавлено описание вкладки «Предметы» на странице «База знаний».",
      "Улучшена оптимизация нескольких компонентов."
    ]
  },
  {
    "version": "0.5.2",
    "date": "2025-04-11",
    "changes": [
      "Добавлены новые рецепты и материалы для крафта:",
      "— Синтезированный эликсир богатства I;",
      "— Вершитель судеб (ур. 9);",
      "— Душегуб (ур. 9);",
      "Масштабно переработана «Главная» страница.",
      "Добавлена страница «Помощь», которая описывает основные игровые системы и механики. Теперь можно подробнее узнать об особенностях характеристик, классов, предметов, а также прочую информацию по игре.",
      "Исправлена ошибка, которая приводила к выводу пустого окна после сражения, если с противника не выпадали предметы для крафта.",
      "Исправлена ошибка, когда за победу в сражении неправильно начислялось золото.",
      "Исправлены прочие мелкие ошибки."
    ]
  },
  {
    "version": "0.5.1",
    "date": "2025-04-10",
    "changes": [
      "Улучшена система крафта.",
      "Добавлена новая вкладка «Материалы» на странице «Инвентарь», где отображаются ресурсы, выпадающие с побеждённых врагов. Теперь отслеживать дроп стало удобнее.",
      "Вкладка «Крафт» переименована в «Рецепты».",
      "Добавлены уведомления об отсутствии материалов и рецептов в соответствующих вкладках.",
      "Теперь при победе над противником появляется окно с полной информацией о дропе, включая выпавшие ресурсы и золото.",
      "Внесены улучшения в интерфейс магазина."
    ]
  },
  {
    "version": "0.5.0",
    "date": "2025-04-09",
    "changes": [
      "Добавлена система крафта предметов.",
      "На странице «Инвентарь» во вкладке «Крафт» теперь отображаются выпавшие с монстров рецепты, а также материалы и ресурсы, необходимые для создания предмета. Создаваемые предметы по характеристикам превосходят аналогичные предметы того же уровня, продающиеся в магазине. Материалы и рецепты выпадают в зависимости от локации, в которой вы сражаетесь. Чем выше сложность локации, тем лучше рецепты и материалы.",
      "Добавлены предметы для крафта:",
      "— Синтезированный эликсир здоровья I;",
      "— Синтезированный эликсир здоровья II;",
      "— Синтезированный эликсир здоровья III;",
      "— Синтезированный эликсир здоровья IV;",
      "— Меч благих намерений (ур. 1);",
      "— Ритуальный кинжал (ур. 1);",
      "— Темный легион (ур. 4);",
      "— Последний вздох (ур. 4);",
      "Оптимизирована работа модальных окон. Произведены улучшения на страницах: «Карта», «Магазин»."
    ]
  },
  {
    "version": "0.4.0",
    "date": "2025-04-05",
    "changes": [
      "Добавлена система локаций.",
      "Теперь на странице «Карта» необходимо выбрать желаемую по уровню локацию, и противники будут отсортированы в диапазоне 4 уровней. Ранее система сортировки противников работала в пределах текущего уровня персонажа. Новая система позволяет иметь больше гибкости в выборе уровня противника.",
      "Исправлены ошибки в отображении изображений предметов на странице «Магазин»."
    ]
  },
  {
    "version": "0.3.0",
    "date": "2025-03-29",
    "changes": [
      "Добавлены изображения для всех существующих предметов.",
      "Исправлены ошибки и оптимизированы различные игровые системы."
    ]
  },
  {
    "version": "0.2.0",
    "date": "2025-03-26",
    "changes": [
      "Добавлены новые предметы до 13 уровня включительно.",
      "Произведен ребаланс всех существующих предметов: оружия, брони и расходных материалов.",
      "Исправлены ошибки."
    ]
  },
  {
    "version": "0.1.0",
    "date": "2025-03-20",
    "changes": [
      "Добавлена система сражений.",
      "Добавлен функционал для тестирования игровых механик.",
      "Добавлена логика инвентаря и экипировки персонажа.",
      "Добавлены предметы: оружие, броня, расходные эликсиры.",
      "Добавлена возможность покупать предметы в магазине, а также чинить и продавать их."
    ]
  }
]