[
  {
    "version": "0.5.0",
    "date": "2025-04-09",
    "changes": [
      "Добавлена система крафта предметов.",
      "На старнице инвентаря во вкладке Крафт теперь отображаются выпавшие с монстров рецепты, а также материалы и ресурсы, которые необходимы для создания предмета. Сами создаваемые предметы по характеристикам превосходят аналогичные по уровню, что продаются в магазине. Материалы и рецепты выпадают в зависимости от локации в которой вы сражаетесь. Чем выше сложность локации, тем лучше рецепты и материалы.",
      "Добавлены крафт предметы:",
      "Синтезированный эликсир здоровья I",
      "Синтезированный эликсир здоровья II",
      "Синтезированный эликсир здоровья III",
      "Синтезированный эликсир здоровья IV",
      "Меч благих намерений (лв.1)",
      "Ритуальный кинжал (лв.1)",
      "Темный легион (лв.4)",
      "Последний вздох (лв.4)",
      "Оптимизирована работа модальных окон. Произведены улучшения на страницах: Карта, Магазин."
    ]
  },
  {
    "version": "0.4.0",
    "date": "2025-04-05",
    "changes": [
      "Добавлена система локаций.",
      "Теперь на странице Карта необходимо выбрать желаемую по уровню локацию и противники будут отсортированы в диапазоне 4 уровней. Ранее система сортировки противников работала в пределах текущего уровня персонажа. Новая система теперь позволяет иметь больше гибкости в выборе уровня противника.",
      "Исправлены ошибки в отображении изображений предметов на странице Магазин."
    ]
  },
  {
    "version": "0.3.0",
    "date": "2025-03-29",
    "changes": [
      "Добавлены изображения для всех существующих предметов.",
      "Исправлены ошибки и оптимизированы различные игровые системы."
    ]
  },
  {
    "version": "0.2.0",
    "date": "2025-03-26",
    "changes": [
      "Добавлены новые предметы до 13 уровня включительно.",
      "Произведен ребаланс всех существующих предметов: оружия, брони и расходных материалов.",
      "Исправлены ошибки"
    ]
  },
  {
    "version": "0.1.0",
    "date": "2025-03-20",
    "changes": [
      "Добавлена система сражений.",
      "Добавлен функционал для тестирования игровых механик.",
      "Добавлена логика инвентаря и экипировки персонажа.",
      "Добавлены предметы: оружие, броня, расходные эликсиры.",
      "Добавлена возможность покупать предметы в магазине, а также чинить предметы и продавать"
    ]
  }
]